import heartIcon from '@assets/icons/message-heart.svg';
import componentsIcon from '@assets/icons/layout-grid-add.svg';
import chartLineIcon from '@assets/icons/chart-line.svg';

export const hypothesisMultiList = [
  {
    text: 'Упрощенная иерархическая система меню позволит администраторам  легко  ориентироваться в  структуре  панели  и  быстро  находить  необходимые  функции.',
  },
  {
    text: 'Добавление функционала распределения ролей на слушателей и тьюторов при создании групп курса позволит упростить и ускорить процесс формирования групп.',
  },
  {
    text: 'Администраторы смогут более эффективно управлять пользователями и группами благодаря  фильтрации и сортировке данных в списках.',
  },
  {
    text: 'Внедрение дополнительных полей при добавлении слушателей вручную повысит качество данных о слушателях, делая их более полными и точными.',
  },
  {
    text: 'Разбивка формы на шаги при создании группы позволит пользователю исправлять ошибки по мере заполнения, уменьшая риск упустить важные данные ',
  },
  {
    text: 'Внедрение подсказок при работе с правами пользователей  повысит уровень понимания администраторов и сократит количество ошибок.',
  },
];

export const resultMultiList = [
  {
    text: 'Положительный  отзыв  от  заказчика подтверждает  полное  соответствие  дизайна  всем  поставленным  требованиям',
    url: heartIcon,
  },
  {
    text: 'Дизайн  админ-панели  оказался  удобным  и  функциональным.  Она  позволяет  эффективно  управлять  курсами  и  пользователями',
    url: componentsIcon,
  },
  {
    text: 'Мы  не  остановились  на  достигнутом  и  продолжили  работу  над  LMS-системой,  добавляя  новые  функции  и  улучшая  существующие',
    url: chartLineIcon,
  },
];
