import article from '@assets/icons/article.svg';
import horseToy from '@assets/icons/horse-toy.svg';
import calendar from '@assets/icons/calendar.svg';
import clock from '@assets/icons/clock-play.svg';
import chartLine from '@assets/icons/chart-line.svg';
import book from '@assets/icons/book.svg';

export const hypothesisTableData = [
  {
    text: 'Быть более информированными о развитии и скачках роста ребенка, чтобы понимать что происходит в данный момент.',
  },
  {
    text: 'Видеть плановый график вакцинации, чтобы следить за тем, какие еще прививки должны быть сделаны.',
  },
  {
    text: 'Видеть календарь развития ребенка по неделям, чтобы более точно прогнозировать предстоящие этапы скачки роста.',
  },
  {
    text: 'Видеть прогресс в виде графиков и диаграмм для визуализации данных о росте, сне и кормлении, чтобы следить за прогрессом.',
  },
  {
    text: 'Следить за режимом сна и кормления с помощью трекеров, чтобы понимать, какие изменения внести для улучшения.',
  },
  {
    text: 'Иметь доступ к библиотеке со статьями о воспитании, чтобы быть более уверенными в своих родительских навыках.',
  },
  {
    text: 'Видеть список упражнений и игр, адаптированных для каждого этапа развития ребенка, чтобы быстро составить план занятий.',
  },
  {
    text: 'Видеть функцию трекера роста зубов, чтобы лучше отслеживать этот процесс и своевременно обращаться к врачу.',
  },
  {
    text: 'Обратиться к экспертам через функцию онлайн-консультаций в приложении, чтобы получить информацию и поддержку.',
  },
  {
    text: 'Записывать детали развития ребенка в дневник с заметками и фотографиями, чтобы отмечать там важные события.',
  },
];

export const conclusionTableData = [
  {
    url: article,
    text: 'Реализовать возможность изучать информацию о воспитании и развитии ребенка каждую неделю',
  },
  {
    url: horseToy,
    text: 'Реализовать возможность просматривать игры и упражнения, подходящие ребенку по возрасту',
  },
  {
    url: calendar,
    text: 'Реализовать календарь с прогнозируемыми периодами кризисов, связанных с ростом ребенка',
  },
  {
    url: clock,
    text: 'Спроектировать трекеры сна и кормления и добавить возможность вносить инфомацию вручную',
  },
  {
    url: chartLine,
    text: 'Реализовать статистику о сне и кормлении ребенка в виде графика или диаграммы',
  },
  {
    url: book,
    text: 'Спроектировать библиотеку статей, подходящих по возрасту и сгруппированных по тематике',
  },
];

export const interviewTableData = [
  ['Вопрос', 'Респондент №1', 'Респондент №2', 'Респондент №3'],
  [
    'Пользуетесь ли вы приложениями для ухода за ребенком?',
    'Я использую приложение для отслеживания режима сна и кормления',
    'Пыталась использовать, но пока времени не хватает. Иногда отмечаю время кормления.',
    'Я отслеживаю кормление и сон ребенка, и еще использую приложение с упражнениями.',
  ],
  [
    'Какие сложные моменты у вас возникают? К кому обращаетесь за советом?',
    'Сложности с режимом сна ребенка, чаще всего я обращаюсь за советом к своим родителям, друзьям или педиатру.',
    'Колики, сон, уход, питание, много сложностей. Я обычно ищу информацию в интернете, или читаю форумы.',
    'Сложности есть, например режим сна. Я спрашиваю совета у своих знакомых, или смотрю видео на ютубе по интересующим вопросам.',
  ],
  [
    'Какие сложные моменты у вас возникают? К кому обращаетесь за советом?',
    'Сложности с режимом сна ребенка, чаще всего я обращаюсь за советом к своим родителям, друзьям или педиатру.',
    'Колики, сон, уход, питание, много сложностей. Я обычно ищу информацию в интернете, или читаю форумы.',
    'Сложности есть, например режим сна. Я спрашиваю совета у своих знакомых, или смотрю видео на ютубе по интересующим вопросам.',
  ],
  [
    'Как вы следите за сном ребенка?',
    'Сейчас использую приложение, так удобнее.',
    'Стараюсь следовать расписанию, но не всегда удается.',
    'Слежу за желанием ребенка в первую очередь, использую приложение.',
  ],
  [
    'А как следите за кормлением?',
    'В приложении записывая время и количество кормлений, следую рекомендациям педиатра для поддержания правильного веса.',
    'Ставлю таймеры, чтобы кормить ребенка по часам. Слежу так же за плачем, иногда кормлю дополнительно. Пока не веду записей.',
    'В приложении отмечаю, какой грудью кормила. Записывая время и длительность кормлений. Ставлю иногда таймер.',
  ],
  [
    'Как вы развиваете ребенка, где ищете  упражнения?',
    'Я опираюсь на рекомендации педиатра, книги о развитии детей. Много читаю информации в интернете.',
    'Я обращаюсь к форумам в интернете в сообществах родителей, обмениваюсь опытом с другими родителями.',
    'Смотрю обучающие видео для родителей, делаю массажи по урокам. Читаю книги для родителей.',
  ],
  [
    'У вас есть график вакцинации?',
    'Да, у нас есть график вакцинации, который рекомендован педиатром. Там же отмечены предстоящие прививики.',
    'Я отслеживаю график вакцинации ребенка, записывая каждую проведенную прививку.',
    'Я веду специальный дневник прививок, записываю даты и типы прививок, которые ребенок уже получил.',
  ],
  [
    'Как вы следите за ростом зубов ребенка?',
    'Пока жду появления первых зубов, буду отмечать в графике.',
    'Замечаю рост зубов, записей пока не веду.',
    'Отмечаю у себя в дневнике даты появления первых зубов.',
  ],
  [
    'Как вы отслеживаете развитие ребенка и ведете ли записи о важных моментах?',
    'Веду записи в заметках в телефоне, отмечаю рост, вес, новые навыки. Еще смотрю мед. карту ребенка, в которую педиатр записывает все данные.',
    'Стараюсь записывать рост и вес, регулярно их измеряю, чтобы в случае чего вовремя обратиться к врачу.',
    'Я регулярно записываю вес, рост, и другие показатели в специальный журнал развития ребенка. Еще записываю новые навыки в развитии.',
  ],
  [
    'Какие функции хотели бы видеть в приложении для отслеживания развития ребенка?',
    'Отслеживание роста, веса, длины тела, обхвата головы и других показателей. Трекер сна, кормления и тд. Статистика с графиком.',
    'Различные рекомендации и информация о развитии ребенка для разных возрастов. Журнал развития с фиксацией важных событий.',
    'Отслеживание физического развития, включая рост, вес, обхват головы. Функция отслеживания сна, кормления. Полезные статьи.',
  ],
];
