export const data = [
  {
    text: 'Быть более информированными о развитии и скачках роста ребенка, чтобы понимать что происходит в данный момент.',
  },
  {
    text: 'Видеть плановый график вакцинации, чтобы следить за тем, какие еще прививки должны быть сделаны.',
  },
  {
    text: 'Видеть календарь развития ребенка по неделям, чтобы более точно прогнозировать предстоящие этапы скачки роста.',
  },
  {
    text: 'Видеть прогресс в виде графиков и диаграмм для визуализации данных о росте, сне и кормлении, чтобы следить за прогрессом.',
  },
  {
    text: 'Следить за режимом сна и кормления с помощью трекеров, чтобы понимать, какие изменения внести для улучшения.',
  },
  {
    text: 'Иметь доступ к библиотеке со статьями о воспитании, чтобы быть более уверенными в своих родительских навыках.',
  },
  {
    text: 'Видеть список упражнений и игр, адаптированных для каждого этапа развития ребенка, чтобы быстро составить план занятий.',
  },
  {
    text: 'Видеть функцию трекера роста зубов, чтобы лучше отслеживать этот процесс и своевременно обращаться к врачу.',
  },
  {
    text: 'Обратиться к экспертам через функцию онлайн-консультаций в приложении, чтобы получить информацию и поддержку.',
  },
  {
    text: 'Записывать детали развития ребенка в дневник с заметками и фотографиями, чтобы отмечать там важные события.',
  },
];

export const ImgData = [
  {
    url: '/article.svg',
    text: 'Реализовать возможность изучать информацию о воспитании и развитии ребенка каждую неделю',
  },
  {
    url: '/horseToy.svg',
    text: 'Реализовать возможность просматривать игры и упражнения, подходящие ребенку по возрасту',
  },
  {
    url: '/calendarEvent.svg',
    text: 'Реализовать календарь с отмеченными прогнозируемыми периодами кризисов, связанных с ростом ребенка',
  },
  {
    url: '/clockPlay.svg',
    text: 'Спроектировать трекеры сна и кормления и добавить возможность вносить инфомацию вручную',
  },
  {
    url: '/chartLine.svg',
    text: 'Реализовать статистику о сне и кормлении ребенка в виде графика или диаграммы',
  },
  {
    url: '/book.svg',
    text: 'Спроектировать библиотеку статей, подходящих по возрасту и сгруппированных по тематике',
  },
];
