import messageHeartIcon from '@assets/icons/message-heart.svg';
import graphIcon from '@assets/icons/graph.svg';
import componentIcon from '@assets/icons/component.svg';

export const processMultiList = [
  {
    title: 'Польза информации',
    text: 'Целевое значение: 20% пользователей находят полученные данные полезными для себя.',
  },
  {
    title: 'Увеличить количество регистраций ',
    text: 'Целевое значение: Увеличить количество зарегистрированных пользователей на 20%',
  },
  {
    title: 'Количество запросов в месяц',
    text: 'Целевое значение: Каждый активный пользователь совершает хотя бы 2 запроса в месяц.',
  },
];

export const interviewTableData = [
  ['Вопрос', 'Респондент №1', 'Респондент №2'],
  [
    'Расскажите о вашей образовательной программе: какая специальность, форма обучения?',
    'У нас онлайн-школа для обучения цифровому маркетингу. Программа охватывает все: от основ SEO и контекстной рекламы до аналитики. Обучение проходит в онлайн-формате, с использованием видеоуроков, практических заданий и индивидуальных консультаций. Я работаю с этой программой 3 года, за это время мы подготовили более 200 специалистов, которые сейчас работают в разных компаниях.',
    'Я руководитель образовательной программы по аналитике данных для тех, кто хочет освоить профессию data scientist или data analyst. Обучение проходит в смешанном формате: онлайн-лекции в комбинации с недельными оффлайн-встречами с преподавателями и сокурсниками. Мы работаем уже четыре года, и за это время выпустили более ста специалистов.',
  ],
  [
    'Как вы сейчас оцениваете востребованность выпускников на рынке труда?',
    'Что касается востребованности выпускников... с одной стороны, спрос на цифровых  маркетологов растет, что хорошо. Но с другой стороны, рынок становится все более  конкурентным.  Чтобы найти работу, нужно быть действительно компетентным  специалистом и иметь соответствующий опыт.',
    'Востребованность выпускников на рынке труда достаточно высока, спрос на data scientists  растет с каждым годом. Но в то же время конкуренция в этой сфере увеличивается, и работодатели ставят все более высокие требования к кандидатам.',
  ],
  [
    'Используете ли вы инструменты для анализа рынка труда?  какие?  что вам в них нравится/не нравится?',
    'Я использую HeadHunter  и  Superjob, а также специализированные ресурсы по цифровому  маркетингу, например, SEMrush. Они дают общее представление о требованиях работодателей и о конкуренции на рынке. Мне не хватает инструментов, которые позволяли бы проводить более глубокий анализ вакансий и требований к кандидатам по конкретной специальности в цифровом маркетинге.',
    'Для анализа рынка труда я использую различные инструменты, например, HeadHunter,  Superjob, LinkedIn. Они позволяют отслеживать открытые вакансии, требования к кандидатам, уровень зарплат. Не хватает  информации  о  конкретных  навыках,  которые  наиболее  востребованы  в  разных  нишах  аналитики  данных,  о  тенденциях  в  развитии  профессии,  о  новых  инструментах  и  технологиях.',
  ],
  [
    'Что вам нужно знать о рынке труда, чтобы лучше подготовить студентов к работе?',
    'Мне нужна более детальная и информативная картина рынка труда в сфере цифрового маркетинга, чтобы я могла эффективнее строить учебный план и подготовить студентов к  реальной работе.',
    'В идеале, я хотела бы иметь доступ к данным о востребованности конкретных навыков, о  требованиях к кандидатам в зависимости от уровня опыта и о среднем уровне зарплат в разных регионах и отраслях.',
  ],
];

export const resultMultiList = [
  {
    text: 'По результатам опроса 31.2% пользователей находят предоставленную информацию полезной для себя.',
    url: messageHeartIcon,
  },
  {
    text: 'Число зарегистрованных пользователей за месяц выросло на 25%.',
    url: graphIcon,
  },
  {
    text: '55% зарегистрированных пользователей активны, каждый пользователь совершает 2 запроса в месяц.',
    url: componentIcon,
  },
];
